Repository: ystk/debian-resolvconf
Catalog: debian/po/*.po
Languages: pt

source: Prepare /etc/resolv.conf for dynamic updates?
pt: Preparar /etc/resolv.conf para actualizações dinâmicas?

source: The resolvconf package contains the infrastructure required for dynamic updating of the resolver configuration file. Part of the necessary infrastructure is a symbolic link from /etc/resolv.conf to /etc/resolvconf/run/resolv.conf. If you choose this option then this link will be created; the existing /etc/resolv.conf file will be preserved as /etc/resolvconf/resolv.conf.d/original, and will be restored if this package is removed.
pt: O pacote resolvconf contém a infraestrutura requerida para actualizar dinamicamente o ficheiro de configuração do "resolver". Parte da infraestrutura necessária é uma ligação simbólica de /etc/resolv.conf para /etc/resolvconf/run/resolv.conf. Se concordar, esta ligação será criada. O ficheiro /etc/resolv.conf existente será mantido como /etc/resolvconf/resolv.conf.d/original; será reposto se este pacote for removido.

source: Declining this option will prevent future installations from recreating the symbolic link and therefore the resolver configuration file will not be dynamically updated. Dynamic updating can then be activated following instructions in the README file.
pt: Não aceitar esta opção irá prevenir futuras instalações de recriar a ligação simbólica e portanto o ficheiro de configuração do "resolver" não será dinâmicamente actualizado. A actualização dinânica pode então ser activada seguindo as instruções do ficheiro README.

source: The presence of resolvconf can affect the behavior of other programs, so it should not be left installed if unconfigured.
pt: A presença do resolvconf pode afectar o comportamento de outros programas, porisso não deve ser deixado instalado se não-configurado.

source: Network interfaces reconfiguration mandatory
pt: Obrigatória reconfiguração das interfaces de rede

source: Once resolvconf is installed, interface configurers supply name server information to it (which it then makes available to the C library resolver and to DNS caches). However, they do this only when they bring up interfaces. Therefore for resolvconf's name server information to be up to date after initial installation it is necessary to reconfigure interfaces (that is, to take them down and then to bring them up again) and to restart DNS caches.
pt: Após o resolvconf instalado, configuradores de interface fornecem-lhe a informação dos servidores de nomes (que depois é passada para o "resolver" da Biblioteca C e para as caches de DNS). No entanto, isto é feito apenas ao activar interfaces. Portanto para que a informação dos servidores de nomes do resolvconf esteja actualizada após a instalação inicial é necessário reconfigurar as interfaces (i.e., desactivá-las e activá-las novamente) e reiniciar as caches DNS.

source: Append original file to dynamic file?
pt: Acrescentar o ficheiro original ao ficheiro dinâmico?

source: If the original static resolver configuration file (/etc/resolv.conf) contains name server addresses, those addresses should be listed on "dns-nameservers" lines in /etc/network/interfaces. For more information, please consult the resolvconf(8) man page and the README file.
pt: Se o ficheiro origina de configuração estática do "resolver" (/etc/resolv.conf) contém endereços de servidores de nomes, esses endereços devem estar listados em linhas "dns-nameservers" em /etc/network/interfaces.Para mais informação, por favor consulte a página de manual resolvonf(8) e o ficheiro README.

source: Until /etc/network/interfaces has been edited and the affected interfaces brought down and up again, the name server addresses will not be included in the dynamically generated resolver configuration file.
pt: Até /etc/networks/interfaces ter sido editado e as interfaces afectadas re-iniciadas, os endereços dos servidores de nomes não serão incluídos no ficheiro de configuração do "resolver" gerado dinâmicamente.

source: If you choose this option, a temporary workaround will be put in place: a symbolic link will be created (if it does not already exist) from /etc/resolvconf/resolv.conf.d/tail to /etc/resolvconf/resolv.conf.d/original. This will cause the whole of that original resolver configuration file to be appended to the dynamically generated file.
pt: Se escolher esta opção, uma resolução temporária será posta em funcionamento: uma ligação simbólica será criada (se não existir) de /etc/resolvconf/resolv.conf.d/tail para /etc/resolvconf/resolv.conf.d/original. Isto irá fazer com que toda a configuração estática seja acrescentada ao ficheiro gerado dinâmicamente.

source: After the required "dns-nameservers" lines have been added to /etc/network/interfaces, the /etc/resolvconf/resolv.conf.d/tail link should be replaced by one to /dev/null.
pt: Após as linhas "dns-nameserver" necessárias terem sido acrescentadas ao ficheiro /etc/network/interfaces, a ligação simbólica /etc/resolvconf/resolv.conf.d/tail deve ser substituída por uma para /dev/null.
